// //заходим в терминал ->>
// //сменить путь к проекту ->>
// cd (change directory) 038_Food-dist
// cd .. ----вернуться в верхнюю директорию
// npm init <enter>
// всё ок ->> yes <enter>
// //появляется файл в проекте ->> package.json
//
// // установка npm пакета в наш проект ->>
// sudo npm install json-server -g --save-dev <enter> // глобально или
// npm install json-server --save-dev <enter> //локально
// ->>
// // sudo <установить глобально>
// //npm
// //install <можно прописать про i>
// //json-server <название пакета, дальше идут доп параметры>
// //-g <можем устанавливать глобально или локально, если локально, то ничего не прописываем,
// предпочтительно устанавливать локально>
// //--save-dev <флаг как этот пакет влияет на наш проект
// данный флаг указывает, что будет исп-ся про разработке
// - или используется при работе нашего проекта внутри (библиотеки джейквери, реакт и др.) - прописывается --save>
//
// //npm i <enter><если мы скачиваем такой проект и нам нужно устновить пакеты, просто прописать в терминале
// команду npm i, если есть package>
// //
// //
// загрузить базу данных --->
// в терминале прописать json-server (указать название файла ->) db.json
//
//
// //060_библиотеки
// установка библиотеки:
//     -установить как npm пакет
// -можно скачать файл и поместить во внутрь проекта и ссылаться на локальный файл или
// -взять cdn сервер и взять файл оттуда
// существует сайт cdnjs.com - ресурс, кот позволяет достукиваться до опр-х файликов